# Turn Data into `Tidy` Form

Tidying variable values as column names
with stack

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

In [3]:
state_fruit = pd.read_csv('data/state_fruit.csv', index_col=0)

In [4]:
state_fruit

         Apple  Orange  Banana
Texas       12      10      40
Arizona      9       7      12
Florida      0      14     190

according to the tidy principles, it isn't actually tidy. Each column
name is actually the value of a variable. In fact, none of the variable names are even present
in the DataFrame. One of the first steps to transform a messy dataset into tidy data is to
identify all of the variables. In this particular dataset, we have variables for state and fruit.
There's also the numeric data that wasn't identified anywhere in the context of the problem.
We can label this variable as weight or any other sensible name.

The stack method takes all of the column
names and reshapes them to be vertical as a single index level:

In [5]:
state_fruit.stack()

Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

With this one `stack` command, we now essentially have tidy data. Each
variable, state, fruit, and weight is vertical.

use the `reset_index` method to
turn the result into a DataFrame:

In [6]:
state_fruit_tidy = state_fruit.stack().reset_index()

In [7]:
state_fruit_tidy

   level_0 level_1    0
0    Texas   Apple   12
1    Texas  Orange   10
2    Texas  Banana   40
3  Arizona   Apple    9
4  Arizona  Orange    7
5  Arizona  Banana   12
6  Florida   Apple    0
7  Florida  Orange   14
8  Florida  Banana  190

Our structure is now correct, but the column names are meaningless. Let's replace
them with proper identifiers:

In [8]:
state_fruit_tidy.columns = ['state', 'fruit', 'weight']

In [9]:
state_fruit_tidy

     state   fruit  weight
0    Texas   Apple      12
1    Texas  Orange      10
2    Texas  Banana      40
3  Arizona   Apple       9
4  Arizona  Orange       7
5  Arizona  Banana      12
6  Florida   Apple       0
7  Florida  Orange      14
8  Florida  Banana     190

In [11]:
state_fruit2 = pd.read_csv('data/state_fruit2.csv')
state_fruit2

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

This command reshapes all the columns, this time including the states, and is not at all what
we need. 

In order to reshape this data correctly, you will need to put all the non-reshaped
columns into the index first with the set_index method, and then use stack.

In [12]:
state_fruit2.set_index('State').stack()

State
Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

Pandas contains a
DataFrame method named melt that works similarly to the stack method described in the
previous recipe but gives a bit more flexibility.

to tidy a simple DataFrame with variable values as
column names with `melt` method

In [14]:
state_fruit2 = pd.read_csv('data/state_fruit2.csv')
state_fruit2

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

Use the melt method by passing the appropriate columns to the id_vars and
value_vars parameters:

In [21]:
#state_fruit2.melt(id_vars=['State'],
#value_vars=['Apple', 'Orange', 'Banana'])

#You actually don't even need a list when melting a
#single column and can simply pass its string value:
state_fruit2.melt(id_vars='State')

     State variable  value
0    Texas    Apple     12
1  Arizona    Apple      9
2  Florida    Apple      0
3    Texas   Orange     10
4  Arizona   Orange      7
5  Florida   Orange     14
6    Texas   Banana     40
7  Arizona   Banana     12
8  Florida   Banana    190

By default, `melt` refers to the transformed
former column names as variable and the corresponding values as value.

Conveniently, melt has two additional parameters, `var_name` and `value_name`,
that give you the ability to rename these two columns:

In [22]:
state_fruit2.melt(id_vars=['State'],
value_vars=['Apple', 'Orange', 'Banana'],
var_name='Fruit',
value_name='Cost')

     State   Fruit  Cost
0    Texas   Apple    12
1  Arizona   Apple     9
2  Florida   Apple     0
3    Texas  Orange    10
4  Arizona  Orange     7
5  Florida  Orange    14
6    Texas  Banana    40
7  Arizona  Banana    12
8  Florida  Banana   190

In [ ]:
state_fruit2.melt(id_vars='State')